; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	image0 - mode
	thermograph1 - mode
	spectrograph2 - mode
	infrared3 - mode
	GroundStation1 - direction
	Star5 - direction
	Star0 - direction
	Star4 - direction
	Star3 - direction
	GroundStation2 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument1 infrared3)
	(supports instrument1 image0)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star5)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument4 spectrograph2)
	(supports instrument4 image0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star4)
	(supports instrument5 infrared3)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon7)
)
(:goal (and
	(pointing satellite2 Star0)
	(pointing satellite3 GroundStation1)
	(have_image Phenomenon6 image0)
	(have_image Phenomenon7 image0)
	(have_image Phenomenon8 infrared3)
	(have_image Planet9 thermograph1)
	(have_image Planet10 thermograph1)
	(have_image Planet11 thermograph1)
))

)

; plan
1. (turn_to satellite2 star0 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star0)
   goals met: 1 of 8
2. (turn_to satellite1 star0 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star0)
   goals met: 1 of 8
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 8
4. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 1 of 8
5. (turn_to satellite1 planet10 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet10)
   goals met: 1 of 8
6. (take_image satellite1 planet10 instrument3 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 2 of 8
7. (turn_to satellite1 phenomenon8 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 8
8. (turn_to satellite0 groundstation1 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation1)
   goals met: 2 of 8
9. (take_image satellite1 phenomenon8 instrument3 infrared3)
   added: (have_image phenomenon8 infrared3)
   goals met: 3 of 8
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 8
11. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 3 of 8
12. (turn_to satellite0 phenomenon6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 8
13. (take_image satellite0 phenomenon6 instrument0 image0)
   added: (have_image phenomenon6 image0)
   goals met: 4 of 8
14. (turn_to satellite0 phenomenon7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 8
15. (take_image satellite0 phenomenon7 instrument0 image0)
   added: (have_image phenomenon7 image0)
   goals met: 5 of 8
16. (turn_to satellite1 planet11 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet11)
   goals met: 5 of 8
17. (take_image satellite1 planet11 instrument3 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 6 of 8
18. (turn_to satellite1 planet9 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet9)
   goals met: 6 of 8
19. (take_image satellite1 planet9 instrument3 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 7 of 8
20. (turn_to satellite3 groundstation1 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 groundstation1)
   goals met: 8 of 8
